app/controllers/users_controller.rb

	def create
		@user = User.new(params[:user])
			if @user.save
---
INSERT INTO "users" ("admin", "updated_at", "name", "email", "created_at", "encrypted_password", "salt") VALUES (NULL, '2013-07-28 11:27:57.722642', 'qwerty', 'qwertyuio@gmail.com', '2013-07-28 11:27:57.722642', '38d8f10360834b0dab856a99041ee6cc63d741d07194e90ef573b0b0d30f705f', '2b13982d149ff1ae7a6e705f4d99a2af169ddb98b635af27e3e65bad33233e05') RETURNING "id"

	def update
		@user = User.find(params[:id])
			if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
UPDATE "users" SET "encrypted_password" = 'dc5eca723b62346910d5572302e366b99a443bb1cae460518f56ab505619ee3f', "updated_at" = '2013-07-27 04:48:51.307855' WHERE "users"."id" = 10